#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
terraform
module.gh_oidc.google_iam_workload_identity_pool.main: Refreshing state... [id=projects/kj-pola-shared-prod/locations/global/workloadIdentityPools/github-actions-pool]
module.project_services.google_project_service.project_services["iam.googleapis.com"]: Refreshing state... [id=kj-pola-shared-prod/iam.googleapis.com]
module.project_services.google_project_service.project_services["storage.googleapis.com"]: Refreshing state... [id=kj-pola-shared-prod/storage.googleapis.com]
module.service_account.google_service_account.service_accounts["terraform-runner"]: Refreshing state... [id=projects/kj-pola-shared-prod/serviceAccounts/terraform-runner@kj-pola-shared-prod.iam.gserviceaccount.com]
module.project_services.google_project_service.project_services["artifactregistry.googleapis.com"]: Refreshing state... [id=kj-pola-shared-prod/artifactregistry.googleapis.com]
module.project_services.google_project_service.project_services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=kj-pola-shared-prod/cloudresourcemanager.googleapis.com]
module.project_services.google_project_service.project_services["logging.googleapis.com"]: Refreshing state... [id=kj-pola-shared-prod/logging.googleapis.com]
module.project_services.google_project_service.project_services["monitoring.googleapis.com"]: Refreshing state... [id=kj-pola-shared-prod/monitoring.googleapis.com]
module.project_services.google_project_service.project_services["serviceusage.googleapis.com"]: Refreshing state... [id=kj-pola-shared-prod/serviceusage.googleapis.com]
module.service_account.google_project_iam_member.project-roles["terraform-runner-kj-pola-shared-prod=>roles/viewer"]: Refreshing state... [id=kj-pola-shared-prod/roles/viewer/serviceAccount:terraform-runner@kj-pola-shared-prod.iam.gserviceaccount.com]
module.service_account.google_project_iam_member.project-roles["terraform-runner-kj-pola-shared-prod=>roles/artifactregistry.writer"]: Refreshing state... [id=kj-pola-shared-prod/roles/artifactregistry.writer/serviceAccount:terraform-runner@kj-pola-shared-prod.iam.gserviceaccount.com]
module.service_account.google_project_iam_member.project-roles["terraform-runner-kj-pola-shared-prod=>roles/iam.serviceAccountUser"]: Refreshing state... [id=kj-pola-shared-prod/roles/iam.serviceAccountUser/serviceAccount:terraform-runner@kj-pola-shared-prod.iam.gserviceaccount.com]
module.service_account.google_project_iam_member.project-roles["terraform-runner-kj-pola-shared-prod=>roles/storage.objectAdmin"]: Refreshing state... [id=kj-pola-shared-prod/roles/storage.objectAdmin/serviceAccount:terraform-runner@kj-pola-shared-prod.iam.gserviceaccount.com]
module.service_account.google_project_iam_member.project-roles["terraform-runner-kj-pola-shared-prod=>roles/serviceusage.serviceUsageAdmin"]: Refreshing state... [id=kj-pola-shared-prod/roles/serviceusage.serviceUsageAdmin/serviceAccount:terraform-runner@kj-pola-shared-prod.iam.gserviceaccount.com]
module.gh_oidc.google_iam_workload_identity_pool_provider.main: Refreshing state... [id=projects/kj-pola-shared-prod/locations/global/workloadIdentityPools/github-actions-pool/providers/github-actions-provider]
module.gh_oidc.google_service_account_iam_member.wif-sa["terraform-runner"]: Refreshing state... [id=projects/kj-pola-shared-prod/serviceAccounts/terraform-runner@kj-pola-shared-prod.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/802307596796/locations/global/workloadIdentityPools/github-actions-pool/attribute.repository/KlubJagiellonski/pola-terraform]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.docker_registry.google_artifact_registry_repository.repo will be created
  + resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + description            = "Rejestr Docker dla obrazów kontenerowych Pola backend"
      + effective_labels       = {
          + "app"                        = "pola"
          + "component"                  = "shared"
          + "env"                        = "prod"
          + "goog-terraform-provisioned" = "true"
          + "iac"                        = "terraform"
          + "org"                        = "klubjagiellonski"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + labels                 = {
          + "app"       = "pola"
          + "component" = "shared"
          + "env"       = "prod"
          + "iac"       = "terraform"
          + "org"       = "klubjagiellonski"
        }
      + location               = "europe-central2"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "kj-pola-shared-prod"
      + registry_uri           = (known after apply)
      + repository_id          = "pola-backend"
      + terraform_labels       = {
          + "app"                        = "pola"
          + "component"                  = "shared"
          + "env"                        = "prod"
          + "goog-terraform-provisioned" = "true"
          + "iac"                        = "terraform"
          + "org"                        = "klubjagiellonski"
        }
      + update_time            = (known after apply)

      + vulnerability_scanning_config (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @skibinstein, Action: `pull_request`, Working Directory: `stacks/projects/kj-pola-shared-prod`, Workflow: `Terraform`*